Revit 2024 API
MEPConnectorInfo.IsPrimary Property
 True if this is the primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsPrimary { get; }
Visual Basic
Public ReadOnly Property IsPrimary As Boolean
	Get
Visual C++
public:
property bool IsPrimary {
	bool get ();
}
See Also
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace